import type { PositionType } from "@/types/schema";
export const positionTypeOptions:{value: PositionType | "All", label: string}[] = [
  { value: "All", label: "ทั้งหมด" },
  { value: "Internship" , label: "Internship" },
  { value: "Part-time", label: "Part-Time" },
  { value: "Job", label: "Full-Time" },
];

export const jobTypeOptions = [
  { value: "All", label: "ทั้งหมด" },
  { value: "งานธนาคาร งานการเงิน งานเกี่ยวกับการลงทุน", label: "งานธนาคาร งานการเงิน งานเกี่ยวกับการลงทุน" },
  { value: "งานระบบคอมพิวเตอร์ งานไอที งานเทคโนโลยีสื่อสาร", label: "งานระบบคอมพิวเตอร์ งานไอที งานเทคโนโลยีสื่อสาร" },
  { value: "งานการผลิต งานขนส่ง งานอุตสาหการ", label: "งานการผลิต งานขนส่ง งานอุตสาหการ" },
  { value: "งานวิจัย งานวิชาการ งานในองค์กรภาครัฐ", label: "งานวิจัย งานวิชาการ งานในองค์กรภาครัฐ" },
  { value: "งานเหมืองแร่ งานทรัพยากร", label: "งานเหมืองแร่ งานทรัพยากร" },
  { value: "งานด้านพลังงาน งานอนุรักษ์", label: "งานด้านพลังงาน งานอนุรักษ์" },
  { value: "งานก่อสร้าง", label: "งานก่อสร้าง" },
  { value: "งานธุรกิจ", label: "งานธุรกิจ" },
  { value: "งานที่ปรึกษา งานวางแผนกลยุทธ์", label: "งานที่ปรึกษา งานวางแผนกลยุทธ์" },
  { value: "งานกลุ่ม Startup งานบริหาร", label: "งานกลุ่ม Startup งานบริหาร" },
  { value: "อื่น ๆ", label: "อื่น ๆ" },
];

export const eligibleYearOptions = [
  { value: "All", label: "ทั้งหมด" },
  { value: "Bachelor’s Freshmen", label: "หลักสูตรปริญญาตรี ระดับชั้นปีที่ 1" },
  { value: "Bachelor's Sophmore", label: "หลักสูตรปริญญาตรี ระดับชั้นปีที่ 2" },
  { value: "Bachelor's Junior", label: "หลักสูตรปริญญาตรี ระดับชั้นปีที่ 3" },
  { value: "Bachelor's Senior", label: "หลักสูตรปริญญาตรี ระดับชั้นปีที่ 4" },
  { value: "Master’s", label: "หลักสูตรปริญญาโท" },
  { value: "Doctorate", label: "หลักสูตรปริญญาเอก" },
];

export const groupedMajorOptions = [
  {
    label: "ปริญญาตรี (หลักสูตรปกติ)",
    options: [
      { value: "สาขาวิชาวิศวกรรมโยธา - ตรีปกติ", label: "สาขาวิชาวิศวกรรมโยธา" },
      { value: "สาขาวิชาวิศวกรรมไฟฟ้า - ตรีปกติ", label: "สาขาวิชาวิศวกรรมไฟฟ้า" },
      { value: "สาขาวิชาวิศวกรรมเครื่องกล - ตรีปกติ", label: "สาขาวิชาวิศวกรรมเครื่องกล" },
      { value: "สาขาวิชาวิศวกรรมยานยนต์ - ตรีปกติ", label: "สาขาวิชาวิศวกรรมยานยนต์" },
      { value: "สาขาวิชาวิศวกรรมอุตสาหการ - ตรีปกติ", label: "สาขาวิชาวิศวกรรมอุตสาหการ" },
      { value: "สาขาวิชาวิศวกรรมเคมี - ตรีปกติ", label: "สาขาวิชาวิศวกรรมเคมี" },
      { value: "สาขาวิชาวิศวกรรมทรัพยากรธรณี - ตรีปกติ", label: "สาขาวิชาวิศวกรรมทรัพยากรธรณี" },
      { value: "สาขาวิชาวิศวกรรมปิโตรเลียม - ตรีปกติ", label: "สาขาวิชาวิศวกรรมปิโตรเลียม" },
      { value: "สาขาวิชาวิศวกรรมสิ่งแวดล้อม - ตรีปกติ", label: "สาขาวิชาวิศวกรรมสิ่งแวดล้อม" },
      { value: "สาขาวิชาวิศวกรรมสำรวจ - ตรีปกติ", label: "สาขาวิชาวิศวกรรมสำรวจ" },
      { value: "สาขาวิชาวิศวกรรมโลหการและวัสดุ - ตรีปกติ", label: "สาขาวิชาวิศวกรรมโลหการและวัสดุ" },
      { value: "สาขาวิชาวิศวกรรมคอมพิวเตอร์ - ตรีปกติ", label: "สาขาวิชาวิศวกรรมคอมพิวเตอร์" },
      { value: "สาขาวิชาวิศวกรรมคอมพิวเตอร์และเทคโนโลยีดิจิทัล - ตรีปกติ", label: "สาขาวิชาวิศวกรรมคอมพิวเตอร์และเทคโนโลยีดิจิทัล" },
      { value: "สาขาวิชาวิศวกรรมนิวเคลียร์และรังสี - ตรีปกติ", label: "สาขาวิชาวิศวกรรมนิวเคลียร์และรังสี" },
    ],
  },
  {
    label: "ปริญญาตรี (หลักสูตรนานาชาติ)",
    options: [
      { value: "Automotive Design and Manufacturing - ตรีนานาชาติ", label: "Automotive Design and Manufacturing" },
      { value: "Nano Engineering - ตรีนานาชาติ", label: "Nano Engineering" },
      { value: "Information and Communication Engineering - ตรีนานาชาติ", label: "Information and Communication Engineering" },
      { value: "Aerospace Engineering - ตรีนานาชาติ", label: "Aerospace Engineering" },
      { value: "Robotics and Artificial Intelligence Engineering - ตรีนานาชาติ", label: "Robotics and Artificial Intelligence Engineering" },
      { value: "Chemical and Process Engineering - ตรีนานาชาติ", label: "Chemical and Process Engineering" },
      { value: "Semiconductor Engineering - ตรีนานาชาติ", label: "Semiconductor Engineering" },
    ],
  },
  {
    label: "ปริญญาโท (หลักสูตรปกติ)",
    options: [
      { value: "สาขาวิชาวิศวกรรมโยธา - โทปกติ", label: "สาขาวิชาวิศวกรรมโยธา" },
      { value: "สาขาวิชาวิศวกรรมไฟฟ้า - โทปกติ", label: "สาขาวิชาวิศวกรรมไฟฟ้า" },
      { value: "สาขาวิชาวิศวกรรมเครื่องกล - โทปกติ", label: "สาขาวิชาวิศวกรรมเครื่องกล" },
      { value: "สาขาวิชาระบบกายภาพที่เชื่อมประสานด้วยเครือข่ายไซเบอร์ - โทปกติ", label: "สาขาวิชาระบบกายภาพที่เชื่อมประสานด้วยเครือข่ายไซเบอร์" },
      { value: "สาขาวิชาวิศวกรรมอุตสาหการ - โทปกติ", label: "สาขาวิชาวิศวกรรมอุตสาหการ" },
      { value: "สาขาวิชาวิศวกรรมเคมี - โทปกติ", label: "สาขาวิชาวิศวกรรมเคมี" },
      { value: "สาขาวิชาวิศวกรรมสิ่งแวดล้อม - โทปกติ", label: "สาขาวิชาวิศวกรรมสิ่งแวดล้อม" },
      { value: "สาขาวิชาวิศวกรรมสำรวจ - โทปกติ", label: "สาขาวิชาวิศวกรรมสำรวจ" },
      { value: "สาขาวิชาวิศวกรรมโลหการและวัสดุ - โทปกติ", label: "สาขาวิชาวิศวกรรมโลหการและวัสดุ" },
      { value: "สาขาวิชาวิศวกรรมพื้นผิวและการกัดกร่อน - โทปกติ", label: "สาขาวิชาวิศวกรรมพื้นผิวและการกัดกร่อน" },
      { value: "สาขาวิชาวิศวกรรมคอมพิวเตอร์ - โทปกติ", label: "สาขาวิชาวิศวกรรมคอมพิวเตอร์" },
      { value: "สาขาวิชาวิทยาศาสตร์คอมพิวเตอร์ (วท.ม.) - โทปกติ", label: "สาขาวิชาวิทยาศาสตร์คอมพิวเตอร์ (วท.ม.)" },
      { value: "สาขาวิชาวิศวกรรมซอฟต์แวร์ (วท.ม.) - โทปกติ", label: "สาขาวิชาวิศวกรรมซอฟต์แวร์ (วท.ม.)" },
      { value: "สาขาวิชาวิศวกรรมนิวเคลียร์ - โทปกติ", label: "สาขาวิชาวิศวกรรมนิวเคลียร์" },
      { value: "สาขาวิชาเทคโนโลยีนิวเคลียร์ (วท.ม.) - โทปกติ", label: "สาขาวิชาเทคโนโลยีนิวเคลียร์ (วท.ม.)" },
      { value: "สาขาวิชาวิศวกรรมแหล่งน้ำ - โทปกติ", label: "สาขาวิชาวิศวกรรมแหล่งน้ำ" },
      { value: "สาขาวิชาการจัดการทรัพยากรน้ำ (วท.ม) - โทปกติ", label: "สาขาวิชาการจัดการทรัพยากรน้ำ (วท.ม)" },
      { value: "สาขาวิชาวิศวกรรมชีวเวช - โทปกติ", label: "สาขาวิชาวิศวกรรมชีวเวช" },
      { value: "สาขาวิชาวิศวกรรมชีวเวช (วท.ม.) - โทปกติ", label: "สาขาวิชาวิศวกรรมชีวเวช (วท.ม.)" },
      { value: "สาขาวิชาวิศวกรรมและเทคโนโลยีการป้องกันประเทศ - โทปกติ", label: "สาขาวิชาวิศวกรรมและเทคโนโลยีการป้องกันประเทศ" },
      { value: "สาขาวิชานวัตวิศวกรรมเพื่อความยั่งยืน (วท.ม) - โทปกติ", label: "สาขาวิชานวัตวิศวกรรมเพื่อความยั่งยืน (วท.ม)" },
    ],
  },
  {
    label: "ปริญญาโท (หลักสูตรนานาชาติ)",
    options: [
      { value: "Vehicle and Rail Infrastructure Engineering - โทนานาชาติ", label: "Vehicle and Rail Infrastructure Engineering" },
      { value: "Petroleum Engineering - โทนานาชาติ", label: "Petroleum Engineering" },
      { value: "Engineering Management - โทนานาชาติ", label: "Engineering Management" },
    ],
  },
  {
    label: "ปริญญาเอก (หลักสูตรปกติ)",
    options: [
      { value: "สาขาวิชาวิศวกรรมไฟฟ้า - เอกปกติ", label: "สาขาวิชาวิศวกรรมไฟฟ้า" },
      { value: "สาขาวิชาวิศวกรรมเครื่องกล - เอกปกติ", label: "สาขาวิชาวิศวกรรมเครื่องกล" },
      { value: "สาขาวิชาวิศวกรรมอุตสาหการ - เอกปกติ", label: "สาขาวิชาวิศวกรรมอุตสาหการ" },
      { value: "สาขาวิชาวิศวกรรมเคมี - เอกปกติ", label: "สาขาวิชาวิศวกรรมเคมี" },
      { value: "สาขาวิชาวิศวกรรมสิ่งแวดล้อม - เอกปกติ", label: "สาขาวิชาวิศวกรรมสิ่งแวดล้อม" },
      { value: "สาขาวิชาวิศวกรรมสำรวจ - เอกปกติ", label: "สาขาวิชาวิศวกรรมสำรวจ" },
      { value: "สาขาวิชาวิศวกรรมโลหการและวัสดุ - เอกปกติ", label: "สาขาวิชาวิศวกรรมโลหการและวัสดุ" },
      { value: "สาขาวิชาวิศวกรรมคอมพิวเตอร์ - เอกปกติ", label: "สาขาวิชาวิศวกรรมคอมพิวเตอร์" },
      { value: "สาขาวิชาวิศวกรรมนิวเคลียร์ - เอกปกติ", label: "สาขาวิชาวิศวกรรมนิวเคลียร์" },
      { value: "สาขาวิชาวิศวกรรมแหล่งน้ำ - เอกปกติ", label: "สาขาวิชาวิศวกรรมแหล่งน้ำ" },
      { value: "สาขาวิชาการจัดการทรัพยากรน้ำ (วท.ด) - เอกปกติ", label: "สาขาวิชาการจัดการทรัพยากรน้ำ (วท.ด)" },
      { value: "สาขาวิชาวิศวกรรมชีวเวช (วท.ด) - เอกปกติ", label: "สาขาวิชาวิศวกรรมชีวเวช (วท.ด)" },
    ],
  },
  {
    label: "ปริญญาเอก (หลักสูตรนานาชาติ)",
    options: [
      { value: "Civil Engineering - เอกนานาชาติ", label: "Civil Engineering" },
      { value: "Geological Resources and Petroleum Engineering - เอกนานาชาติ", label: "Geological Resources and Petroleum Engineering" },
    ],
  },
];
